[Timeout] StringLiteral
src/components/Grid/Cell.tsx:10:8
 
 const colors: { [key in CellType]: string } = {
   '0': transparent,
-  '1': '#2a48ec',
+  '1': "",
   '2': '#2bb13d',
   '3': '#ec6561',

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:38:12
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${() => undefined};
   border-color: ${({ mousedown = false }) =>
     mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 144
+ Received  + 144

@@ -2,1046 +2,1046 @@

[Timeout] LogicalOperator
src/components/Grid/Cell.tsx:38:30
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${({ children }) => colors[(children as CellType)] && transparent};
   border-color: ${({ mousedown = false }) =>
     mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};

[Timeout] ArrowFunction
src/components/Grid/Cell.tsx:39:19
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
   color: ${({ children }) => colors[children as CellType] ?? transparent};
-  border-color: ${({ mousedown = false }) =>
-    mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.1);

[Timeout] BooleanLiteral
src/components/Grid/Cell.tsx:39:34
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
   color: ${({ children }) => colors[children as CellType] ?? transparent};
-  border-color: ${({ mousedown = false }) =>
+  border-color: ${({ mousedown = true }) =>
     mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
   &:hover {

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:104:5
   };
 
   switch (children) {
-    case CellState.empty:
-      return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
+    case CellState.empty:
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:106:5
   switch (children) {
     case CellState.empty:
       return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
-    case CellState.hidden:
-      return <ClosedFrame {...rest}>{children}</ClosedFrame>;
+    case CellState.hidden:
     case CellState.bomb:
       return (

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:108:5
       return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.flag:
       return (

[Killed] BlockStatement
src/components/Grid/Cell.tsx:136:64
     cell as CellState
   );
 
-const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
-  const [mousedown, onMouseDown, onMouseUp] = useMouseDown();
-  const onClick = () => rest.onClick(coords);
-
-  const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
-    e.preventDefault();
-    if (checkIsActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
-
-  const props = {
-    onClick,
-    onContextMenu,
-    'data-testid': `${coords}`,
-    onMouseDown,
-    onMouseUp,
-    onMouseLeave: onMouseUp,
-    mousedown,
-    role: 'cell',
-  };
-
-  return <ComponentsMap {...props}>{children}</ComponentsMap>;
-};
+const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {};
 
 export default Cell;
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "cell"

Here are the accessible roles:

  banner:

  Name "":
  <header

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:142:9
 
   const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
     e.preventDefault();
-    if (checkIsActiveCell(children)) {
+    if (false) {
       rest.onContextMenu(coords);
     }

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:147:17
     }
   };
 
-  const props = {
-    onClick,
-    onContextMenu,
-    'data-testid': `${coords}`,
-    onMouseDown,
-    onMouseUp,
-    onMouseLeave: onMouseUp,
-    mousedown,
-    role: 'cell',
-  };
+  const props = {};
 
   return <ComponentsMap {...props}>{children}</ComponentsMap>;
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "cell"

Here are the accessible roles:

  banner:

  Name "":
  <header
