[Survived] BlockStatement
src/App.tsx:4:16
 import './App.css';
 import { GameWithHooks } from './modules/GameWithHooks';
 
-function App() {
-  return <GameWithHooks />;
-}
+function App() {}
 
 export default App;
