[Timeout] ArrowFunction
src/components/Scoreboard/Level.tsx:27:38
   padding: 0 0.2vw 0.2vw;
 `;
 
-export const Level: FC<LevelProps> = ({ children, onChange }) => (
-  <Select onChange={onChange}>
-    {children.map((item: string) => (
-      <Option key={item} role='checkbox'>{item}</Option>
-    ))}
-  </Select>
-);
+export const Level: FC<LevelProps> = () => undefined;
 

[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:29:19
 
 export const Level: FC<LevelProps> = ({ children, onChange }) => (
   <Select onChange={onChange}>
-    {children.map((item: string) => (
-      <Option key={item} role='checkbox'>{item}</Option>
-    ))}
+    {children.map(() => undefined)}
   </Select>
 );
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 20
+ Received  +  1

@@ -46,30 +46,11 @@
