[Killed] ArrowFunction
src/components/Scoreboard/Scoreboard.tsx:35:48
   defaultLevel: string;
 }
 
-export const Scoreboard: FC<ScoreboardProps> = ({
-  time,
-  levels,
-  mines,
-  onReset,
-  onChangeLevel,
-  defaultLevel
-}) => (
-  <Wrapper>
-    <Counter>{time}</Counter>
-    <Level onChange={onChangeLevel} value={defaultLevel}>{levels}</Level>
-    <Reset onReset={onReset} />
-    <Counter>{mines}</Counter>
-  </Wrapper>
-);
+export const Scoreboard: FC<ScoreboardProps> = () => undefined;
 
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render behaviour Render game field by default 1`

- Snapshot  - 41
+ Received  +  0

@@ -37,51 +37,10 @@
