[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:18:13
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && true && length - y > 0 && length - x > 0;
 
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {

[Timeout] EqualityOperator
src/helpers/CellsManipulator.ts:18:41
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 && length - y > 0 && length - x <= 0;
 
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:20:76
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
 
-export const incrementNeighbors = (coords: Coords, field: Field): Field => {
-  const items = getNeighborsItems(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < '8')
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbors = (coords: Coords, field: Field): Field => {};
 
 /**

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:23:46
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {
   const items = getNeighborsItems(coords);
 
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < '8')
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
-  }
+  for (const [y, x] of Object.values(items)) {}
 
   return field;

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:24:42
   const items = getNeighborsItems(coords);
 
   for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < '8')
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
+    if (checkItemInField([y, x], field)) {}
   }
 

[Timeout] EqualityOperator
src/helpers/CellsManipulator.ts:27:11
     if (checkItemInField([y, x], field)) {
       const cell = field[y][x];
 
-      if (cell < '8')
+      if (cell <= '8')
         field[y][x] = (+cell + 1).toString() as Cell;
     }

[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:27:11
     if (checkItemInField([y, x], field)) {
       const cell = field[y][x];
 
-      if (cell < '8')
+      if (true)
         field[y][x] = (+cell + 1).toString() as Cell;
     }

[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:52:7
   const [y, x] = coords;
   const gameCell = gameField[y][x];
 
-  if (gameCell === bomb) {
+  if (false) {
     throw new Error('Game Over');
   }

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:56:27
     throw new Error('Game Over');
   }
 
-  if (gameCell === empty) {
-    playerField[y][x] = gameCell;
-
-    const items = getNeighborsItems(coords);
-
-    for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
-        const playerCell = playerField[y][x];
-        const gameCell = gameField[y][x];
-
-        if (playerCell === hidden && gameCell !== bomb) {
-          playerField = openCell([y, x], playerField, gameField);
-        }
-      }
-    }
-  }
+  if (gameCell === empty) {}
 
   playerField[y][x] = gameCell;

[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:56:7
     throw new Error('Game Over');
   }
 
-  if (gameCell === empty) {
+  if (false) {
     playerField[y][x] = gameCell;
 

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:61:48
 
     const items = getNeighborsItems(coords);
 
-    for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
-        const playerCell = playerField[y][x];
-        const gameCell = gameField[y][x];
-
-        if (playerCell === hidden && gameCell !== bomb) {
-          playerField = openCell([y, x], playerField, gameField);
-        }
-      }
-    }
+    for (const [y, x] of Object.values(items)) {}
   }
 

[Timeout] BlockStatement
src/helpers/CellsManipulator.ts:62:48
     const items = getNeighborsItems(coords);
 
     for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
-        const playerCell = playerField[y][x];
-        const gameCell = gameField[y][x];
-
-        if (playerCell === hidden && gameCell !== bomb) {
-          playerField = openCell([y, x], playerField, gameField);
-        }
-      }
+      if (checkItemInField([y, x], gameField)) {}
     }
   }

[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:66:13
         const playerCell = playerField[y][x];
         const gameCell = gameField[y][x];
 
-        if (playerCell === hidden && gameCell !== bomb) {
+        if (false) {
           playerField = openCell([y, x], playerField, gameField);
         }

[Timeout] ConditionalExpression
src/helpers/CellsManipulator.ts:66:38
         const playerCell = playerField[y][x];
         const gameCell = gameField[y][x];
 
-        if (playerCell === hidden && gameCell !== bomb) {
+        if (playerCell === hidden && true) {
           playerField = openCell([y, x], playerField, gameField);
         }
