[Timeout] ArrowFunction
src/helpers/Field.ts:17:46
 export type Field = Cell[][];
 export type Coords = [number, number];
 
-export const generateFieldWithDefaultState = (
-  size: number,
-  state: Cell = CellState.empty
-): Field => Array.from(Array(size), () => new Array(size).fill(state));
+export const generateFieldWithDefaultState = () => undefined;
 
 export const fieldGenerator = (size: number, density: number): Field => {

[Timeout] ArrayDeclaration
src/helpers/Field.ts:20:24
 export const generateFieldWithDefaultState = (
   size: number,
   state: Cell = CellState.empty
-): Field => Array.from(Array(size), () => new Array(size).fill(state));
+): Field => Array.from(Array(), () => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {

[Timeout] BlockStatement
src/helpers/Field.ts:22:73
   state: Cell = CellState.empty
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
-export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
-    throw new Error('Density must be between 0 and 1');
-
-  let unProcessedCell = size * size,  
-    restCellsWithBombs = unProcessedCell * density;
-
-  const res: Field = generateFieldWithDefaultState(size);
-
-  for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
-        res[i][j] = CellState.bomb;
-        incrementNeighbors([i, j], res);
-        restCellsWithBombs--;
-      }
-
-      unProcessedCell--;
-    }
-  }
-
-  return res;
-};
+export const fieldGenerator = (size: number, density: number): Field => {};
 

[Timeout] EqualityOperator
src/helpers/Field.ts:23:7
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
+  if (density >= 1 || density < 0)
     throw new Error('Density must be between 0 and 1');
 

[Timeout] EqualityOperator
src/helpers/Field.ts:23:22
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
+  if (density > 1 || density >= 0)
     throw new Error('Density must be between 0 and 1');
 

[Timeout] UpdateOperator
src/helpers/Field.ts:31:29
 
   const res: Field = generateFieldWithDefaultState(size);
 
-  for (let i = 0; i < size; i++) {
+  for (let i = 0; i < size; i--) {
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs / unProcessedCell > Math.random()) {

[Timeout] ConditionalExpression
src/helpers/Field.ts:33:11
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
+      if (true) {
         res[i][j] = CellState.bomb;
         incrementNeighbors([i, j], res);

[Timeout] EqualityOperator
src/helpers/Field.ts:33:11
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
+      if (restCellsWithBombs / unProcessedCell <= Math.random()) {
         res[i][j] = CellState.bomb;
         incrementNeighbors([i, j], res);

[Timeout] ArrayDeclaration
src/helpers/Field.ts:35:28
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs / unProcessedCell > Math.random()) {
         res[i][j] = CellState.bomb;
-        incrementNeighbors([i, j], res);
+        incrementNeighbors([], res);
         restCellsWithBombs--;
       }

[Timeout] UpdateOperator
src/helpers/Field.ts:36:9
       if (restCellsWithBombs / unProcessedCell > Math.random()) {
         res[i][j] = CellState.bomb;
         incrementNeighbors([i, j], res);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
 
