[Timeout] ConditionalExpression
src/helpers/__mocks__/Field.ts:4:7
 export const fieldGenerator = (size: number) => {
     switch (size) {
       case 9:
-      default:
-        return [
-          ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
-          ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
-          ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
-          ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
-          ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
-          ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
-          ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
-          ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
-          ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
-        ];
+      default:
       case 16:
         return [

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:6:32
       case 9:
       default:
         return [
-          ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
+          ['0', '0', '0', '0', "", '0', '1', '9', '1'],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],

[Timeout] ArrayDeclaration
src/helpers/__mocks__/Field.ts:6:11
       case 9:
       default:
         return [
-          ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
+          [],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:7:52
       default:
         return [
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
-          ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
+          ['0', '0', '0', '0', '1', '1', '2', '2', ""],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:7:17
       default:
         return [
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
-          ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
+          ['0', "", '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:8:12
         return [
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
-          ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
+          ["", '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:8:17
         return [
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
-          ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
+          ['0', "", '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:9:37
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
-          ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
+          ['0', '0', '1', '1', '3', "", '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:9:27
           ['0', '0', '0', '0', '0', '0', '1', '9', '1'],
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
-          ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
+          ['0', '0', '1', "", '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:10:52
           ['0', '0', '0', '0', '1', '1', '2', '2', '2'],
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
-          ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
+          ['0', '0', '1', '9', '2', '9', '1', '0', ""],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:11:47
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
-          ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
+          ['1', '1', '2', '1', '2', '1', '1', "", '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:11:37
           ['0', '0', '0', '0', '1', '9', '1', '1', '9'],
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
-          ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
+          ['1', '1', '2', '1', '2', "", '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:12:12
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
-          ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
+          ["", '9', '1', '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
           ['0', '0', '0', '1', '9', '2', '9', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:12:22
           ['0', '0', '1', '1', '3', '2', '2', '1', '1'],
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
-          ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
+          ['1', '9', "", '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
           ['0', '0', '0', '1', '9', '2', '9', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:13:12
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
-          ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
+          ["", '1', '1', '1', '1', '2', '1', '3', '2'],
           ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
         ];

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:13:17
           ['0', '0', '1', '9', '2', '9', '1', '0', '0'],
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
-          ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
+          ['1', "", '1', '1', '1', '2', '1', '3', '2'],
           ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
         ];

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:14:12
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
-          ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
+          ["", '0', '0', '1', '9', '2', '9', '2', '9'],
         ];
       case 16:

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:14:22
           ['1', '1', '2', '1', '2', '1', '1', '1', '1'],
           ['1', '9', '1', '0', '0', '0', '0', '1', '9'],
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
-          ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
+          ['0', '0', "", '1', '9', '2', '9', '2', '9'],
         ];
       case 16:

[Timeout] ConditionalExpression
src/helpers/__mocks__/Field.ts:16:7
           ['1', '1', '1', '1', '1', '2', '1', '3', '2'],
           ['0', '0', '0', '1', '9', '2', '9', '2', '9'],
         ];
-      case 16:
-        return [
-          ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
-          ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
-          ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
-          ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
-          ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
-          ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
-          ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
-          ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
-          ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
-          ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
-          ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
-          ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
-          ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
-          ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
-          ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
-          ['0', '0', '0', '1', '9', '3', '2', '1', '1', '3', '9', '3', '9', '1', '0', '0'],
-        ];
+      case 16:
       case 22:
         return [

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:18:37
         ];
       case 16:
         return [
-          ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
+          ['9', '2', '2', '9', '2', "", '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:18:42
         ];
       case 16:
         return [
-          ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
+          ['9', '2', '2', '9', '2', '9', "", '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:19:37
       case 16:
         return [
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
-          ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
+          ['4', '9', '3', '2', '3', "", '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:19:57
       case 16:
         return [
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
-          ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
+          ['4', '9', '3', '2', '3', '2', '1', '0', '0', "", '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:20:87
         return [
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
-          ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
+          ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', ""],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:20:77
         return [
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
-          ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
+          ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', "", '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:21:82
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
-          ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
+          ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', "", '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:21:42
           ['9', '2', '2', '9', '2', '9', '1', '0', '0', '1', '9', '1', '0', '0', '0', '0'],
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
-          ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
+          ['2', '2', '1', '1', '1', '2', "", '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:22:82
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
-          ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
+          ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', "", '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:22:12
           ['4', '9', '3', '2', '3', '2', '1', '0', '0', '2', '2', '2', '0', '1', '1', '1'],
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
-          ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
+          ["", '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:23:27
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
-          ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
+          ['0', '0', '0', "", '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],

[Timeout] ArrayDeclaration
src/helpers/__mocks__/Field.ts:23:11
           ['9', '9', '2', '1', '9', '1', '0', '0', '0', '1', '9', '1', '0', '1', '9', '2'],
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
-          ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
+          [],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:24:47
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
-          ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
+          ['0', '0', '0', '0', '1', '1', '1', "", '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:24:57
           ['2', '2', '1', '1', '1', '2', '2', '3', '2', '2', '1', '1', '0', '1', '2', '9'],
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
-          ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
+          ['0', '0', '0', '0', '1', '1', '1', '1', '9', "", '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],

[Timeout] ArrayDeclaration
src/helpers/__mocks__/Field.ts:25:11
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
-          ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
+          [],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:25:12
           ['0', '0', '0', '0', '0', '1', '9', '9', '9', '1', '0', '1', '1', '1', '1', '1'],
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
-          ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
+          ["", '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:26:47
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
-          ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
+          ['0', '1', '9', '1', '1', '1', '1', "", '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],

[Timeout] ArrayDeclaration
src/helpers/__mocks__/Field.ts:26:11
           ['0', '0', '0', '0', '0', '1', '2', '4', '3', '3', '1', '2', '9', '2', '1', '0'],
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
-          ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
+          [],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:27:57
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
-          ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
+          ['1', '2', '2', '1', '1', '1', '2', '2', '9', "", '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:27:77
           ['0', '0', '0', '0', '1', '1', '1', '1', '9', '2', '9', '2', '2', '9', '1', '0'],
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
-          ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
+          ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', "", '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:28:67
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
-          ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
+          ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', "", '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:28:42
           ['0', '1', '1', '1', '1', '9', '1', '1', '1', '2', '1', '2', '2', '2', '2', '1'],
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
-          ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
+          ['1', '9', '1', '0', '1', '9', "", '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:29:12
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
-          ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
+          ["", '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:29:52
           ['0', '1', '9', '1', '1', '1', '1', '1', '2', '2', '1', '1', '9', '1', '2', '9'],
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
-          ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
+          ['1', '1', '1', '0', '1', '1', '3', '9', "", '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:30:42
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
-          ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
+          ['0', '1', '1', '1', '1', '1', "", '3', '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
           ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:30:47
           ['1', '2', '2', '1', '1', '1', '2', '2', '9', '9', '1', '1', '1', '1', '3', '9'],
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
-          ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
+          ['0', '1', '1', '1', '1', '1', '3', "", '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
           ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:31:57
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
-          ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
+          ['0', '1', '9', '1', '2', '9', '4', '9', '9', "", '3', '2', '0', '1', '9', '1'],
           ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
           ['0', '0', '0', '1', '9', '3', '2', '1', '1', '3', '9', '3', '9', '1', '0', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:31:72
           ['1', '9', '1', '0', '1', '9', '3', '9', '4', '2', '1', '0', '0', '1', '3', '9'],
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
-          ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
+          ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', "", '1', '9', '1'],
           ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
           ['0', '0', '0', '1', '9', '3', '2', '1', '1', '3', '9', '3', '9', '1', '0', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:32:57
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
-          ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
+          ['0', '1', '1', '2', '3', '9', '9', '3', '3', "", '9', '3', '1', '2', '1', '1'],
           ['0', '0', '0', '1', '9', '3', '2', '1', '1', '3', '9', '3', '9', '1', '0', '0'],
         ];

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:32:22
           ['1', '1', '1', '0', '1', '1', '3', '9', '2', '1', '1', '1', '0', '1', '9', '2'],
           ['0', '1', '1', '1', '1', '1', '3', '3', '3', '2', '9', '1', '0', '2', '2', '2'],
           ['0', '1', '9', '1', '2', '9', '4', '9', '9', '4', '3', '2', '0', '1', '9', '1'],
-          ['0', '1', '1', '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
+          ['0', '1', "", '2', '3', '9', '9', '3', '3', '9', '9', '3', '1', '2', '1', '1'],
           ['0', '0', '0', '1', '9', '3', '2', '1', '1', '3', '9', '3', '9', '1', '0', '0'],
         ];
