[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:50:87
           ['0', '0', '0', '1', '1', '2', '9', '2', '2', '2', '2', '9', '2', '1', '2', '1', '1', '0', '0', '1', '2', '2'],
           ['0', '0', '1', '1', '1', '1', '1', '1', '1', '9', '3', '2', '2', '1', '2', '9', '2', '2', '2', '1', '0', '0'],
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
-          ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
+          ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', "", '1', '2', '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:50:97
           ['0', '0', '0', '1', '1', '2', '9', '2', '2', '2', '2', '9', '2', '1', '2', '1', '1', '0', '0', '1', '2', '2'],
           ['0', '0', '1', '1', '1', '1', '1', '1', '1', '9', '3', '2', '2', '1', '2', '9', '2', '2', '2', '1', '0', '0'],
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
-          ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
+          ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', "", '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:51:72
           ['0', '0', '1', '1', '1', '1', '1', '1', '1', '9', '3', '2', '2', '1', '2', '9', '2', '2', '2', '1', '0', '0'],
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
-          ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
+          ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', "", '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:51:17
           ['0', '0', '1', '1', '1', '1', '1', '1', '1', '9', '3', '2', '2', '1', '2', '9', '2', '2', '2', '1', '0', '0'],
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
-          ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
+          ['0', "", '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:52:97
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
-          ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
+          ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', "", '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:52:112
           ['0', '1', '2', '9', '1', '0', '0', '1', '2', '3', '9', '1', '1', '9', '2', '1', '2', '9', '9', '1', '0', '0'],
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
-          ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
+          ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', "", '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:53:27
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
-          ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
+          ['1', '1', '0', "", '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:53:92
           ['0', '1', '9', '3', '3', '2', '1', '1', '9', '3', '2', '1', '1', '1', '1', '0', '1', '2', '2', '1', '0', '0'],
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
-          ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
+          ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', "", '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:54:47
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
-          ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
+          ['9', '2', '0', '2', '3', '5', '9', "", '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:54:77
           ['0', '1', '1', '2', '9', '9', '2', '2', '4', '9', '2', '1', '1', '1', '0', '0', '0', '0', '1', '1', '1', '0'],
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
-          ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
+          ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', "", '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:55:42
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
-          ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
+          ['9', '3', '1', '1', '9', '9', "", '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:55:67
           ['0', '0', '0', '2', '3', '4', '3', '9', '5', '9', '3', '2', '9', '2', '0', '0', '0', '0', '1', '9', '2', '1'],
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
-          ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
+          ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', "", '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:56:77
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
-          ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
+          ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', "", '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
           ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:56:27
           ['1', '1', '0', '1', '9', '3', '9', '4', '9', '9', '3', '2', '9', '2', '0', '1', '1', '1', '1', '2', '9', '1'],
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
-          ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
+          ['3', '9', '2', "", '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
           ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:57:42
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
-          ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
+          ['2', '9', '3', '1', '0', '1', "", '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
           ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
         ];

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:57:112
           ['9', '2', '0', '2', '3', '5', '9', '3', '3', '9', '2', '1', '1', '1', '0', '2', '9', '3', '1', '2', '2', '2'],
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
-          ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
+          ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', "", '1'],
           ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
         ];

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:58:32
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
-          ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
+          ['1', '2', '9', '1', "", '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
         ];
     }

[Timeout] StringLiteral
src/helpers/__mocks__/Field.ts:58:22
           ['9', '3', '1', '1', '9', '9', '2', '1', '1', '2', '2', '1', '0', '0', '0', '3', '9', '5', '9', '2', '2', '9'],
           ['3', '9', '2', '1', '2', '2', '1', '0', '0', '1', '9', '1', '0', '0', '0', '2', '9', '4', '9', '2', '2', '9'],
           ['2', '9', '3', '1', '0', '1', '1', '2', '1', '2', '1', '2', '1', '1', '0', '1', '1', '2', '2', '2', '2', '1'],
-          ['1', '2', '9', '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
+          ['1', '2', "", '1', '0', '1', '9', '2', '9', '1', '0', '1', '9', '1', '0', '0', '0', '0', '1', '9', '1', '0'],
         ];
     }

[Killed] ArrowFunction
src/helpers/__mocks__/Field.ts:71:48
     weakFlag: '12',
   };
   
-  export const generateFieldWithDefaultState = (
-    size: number,
-    state = CellState.empty
-  ) => new Array(size).fill(null).map(() => new Array(size).fill(state));
+  export const generateFieldWithDefaultState = () => undefined;
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/helpers/__mocks__/Field.ts:74:39
   export const generateFieldWithDefaultState = (
     size: number,
     state = CellState.empty
-  ) => new Array(size).fill(null).map(() => new Array(size).fill(state));
+  ) => new Array(size).fill(null).map(() => undefined);
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
