[Killed] ObjectLiteral
src/modules/GameSettings.ts:10:59
 
 export type Settings = [Size, Bombs];
 
-export const GameSettings: Record<LevelNames, Settings> = {
-  easy: [9, 10],
-  medium: [16, 44],
-  hard: [22, 99],
-};
+export const GameSettings: Record<LevelNames, Settings> = {};
 
 
killedBy: GameWithHooks test cases Render behaviour Render game field by default
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Timeout] ArrayDeclaration
src/modules/GameSettings.ts:12:11
 
 export const GameSettings: Record<LevelNames, Settings> = {
   easy: [9, 10],
-  medium: [16, 44],
+  medium: [],
   hard: [22, 99],
 };
