[Timeout] ArrowFunction
src/modules/GameWithHooks/GameWithHooks.tsx:47:48
           onReset={onReset}
         />
         {isGameOver && <GameOver onClick={onReset} isWin={isWin} />}
-        <Grid onClick={onClick} onContextMenu={() => null}>
+        <Grid onClick={onClick} onContextMenu={() => undefined}>
           {playerField}
         </Grid>
