[Timeout] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:25:48
 
 const useGame = (): ReturnType => {
   const [level, setLevel] = useState<LevelNames>('easy');
-  const [isGameOver, setIsGameOver] = useState(false);
+  const [isGameOver, setIsGameOver] = useState(true);
   const [isWin, setIsWin] = useState(false);
 

[Timeout] BlockStatement
src/modules/GameWithHooks/useGame.ts:38:39
     fieldGenerator(size, bombs / (size * size))
   );
 
-  const onClick = (coords: Coords) => {
-    if (isGameOver) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (e) {
-      setPlayerField([...gameField]);
-      setIsGameOver(true);
-    }
-  };
+  const onClick = (coords: Coords) => {};
 
   const resetHandler = ([size, bombs]: [number, number]) => {

[Timeout] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:39:9
   );
 
   const onClick = (coords: Coords) => {
-    if (isGameOver) return;
+    if (false) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);

[Timeout] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:39:9
   );
 
   const onClick = (coords: Coords) => {
-    if (isGameOver) return;
+    if (true) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);

[Timeout] BlockStatement
src/modules/GameWithHooks/useGame.ts:40:9
 
   const onClick = (coords: Coords) => {
     if (isGameOver) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (e) {
+    try {} catch (e) {
       setPlayerField([...gameField]);
       setIsGameOver(true);

[Timeout] BlockStatement
src/modules/GameWithHooks/useGame.ts:43:17
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
-    } catch (e) {
-      setPlayerField([...gameField]);
-      setIsGameOver(true);
-    }
+    } catch (e) {}
   };
 

[Timeout] BlockStatement
src/modules/GameWithHooks/useGame.ts:62:48
     setIsWin(false);
   };
 
-  const onChangeLevel = (level: LevelNames) => {
-    setLevel(level as LevelNames);
-    const newSettings = GameSettings[level as LevelNames];
-    resetHandler(newSettings);
-  };
+  const onChangeLevel = (level: LevelNames) => {};
 
   const onReset = () => resetHandler([size, bombs]);

[Killed] ObjectLiteral
src/modules/GameWithHooks/useGame.ts:70:10
 
   const onReset = () => resetHandler([size, bombs]);
 
-  return {
-    level,
-    isGameOver,
-    isWin,
-    settings: [size, bombs],
-    playerField,
-    onClick,
-    onChangeLevel,
-    onReset,
-    gameField
-  };
+  return {};
 };
 
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 4

  Object {
-   "isGameOver": false,
-   "isWin": false,
