[Survived] ArrowFunction
src/components/Grid/Cell.stories.tsx:13:36
   },
 } as Meta;
 
-const Template: Story<CellProps> = (args) => <Cell {...args} />;
+const Template: Story<CellProps> = () => undefined;
 
 export const CellClosed = Template.bind({});

[Survived] ObjectLiteral
src/components/Grid/Cell.stories.tsx:26:17
 };
 
 export const CellBomb = Template.bind({});
-CellBomb.args = {
-  children: CellState.bomb,
-};
+CellBomb.args = {};
 
 export const CellFlag = Template.bind({});

[Survived] ObjectLiteral
src/components/Grid/Cell.stories.tsx:31:17
 };
 
 export const CellFlag = Template.bind({});
-CellFlag.args = {
-  children: CellState.flag,
-};
+CellFlag.args = {};
 
 export const CellWeakFlag = Template.bind({});

[Survived] StringLiteral
src/components/Grid/Cell.stories.tsx:42:13
 
 export const CellWithNumber = Template.bind({});
 CellWithNumber.args = {
-  children: '1',
+  children: "",
 };
 
