[Timeout] StringLiteral
src/components/Grid/Cell.tsx:10:8
 
 const colors: { [key in CellType]: string } = {
   '0': '#000',
-  '1': '#2a48ec',
+  '1': "",
   '2': '#2bb13d',
   '3': '#ec6561',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:12:8
   '0': '#000',
   '1': '#2a48ec',
   '2': '#2bb13d',
-  '3': '#ec6561',
+  '3': "",
   '4': '#233db7',
   '5': '#a6070f',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:13:8
   '1': '#2a48ec',
   '2': '#2bb13d',
   '3': '#ec6561',
-  '4': '#233db7',
+  '4': "",
   '5': '#a6070f',
   '6': '#e400af',

[Survived] StringLiteral
src/components/Grid/Cell.tsx:16:8
   '4': '#233db7',
   '5': '#a6070f',
   '6': '#e400af',
-  '7': '#906a02',
+  '7': "",
   '8': '#fa0707',
   '9': transparent,

[Survived] BooleanLiteral
src/components/Grid/Cell.tsx:38:34
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mousedown = false }) =>
+  border-color: ${({ mousedown = true }) =>
     mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
   &:hover {

[Survived] ArrowFunction
src/components/Grid/Cell.tsx:38:19
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mousedown = false }) =>
-    mousedown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.1);

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:129:34
   }
 };
 
-export const checkIsActiveCell = (cell: CellType): boolean =>
-  [CellState.hidden, CellState.flag, CellState.weakFlag].includes(
-    cell as CellState
-  );
+export const checkIsActiveCell = () => undefined;
 
 const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] BlockStatement
src/components/Grid/Cell.tsx:134:64
     cell as CellState
   );
 
-const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
-  const [mousedown, onMouseDown, onMouseUp] = useMouseDown();
-  const onClick = () => rest.onClick(coords);
-
-  const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
-    e.preventDefault();
-    if (checkIsActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
-
-  const props = {
-    onClick,
-    onContextMenu,
-    'data-testId': `${children}_${coords}`,
-    onMouseDown,
-    onMouseUp,
-    onMouseLeave: onMouseUp,
-    mousedown,
-  };
-
-  return <ComponentsMap {...props}>{children}</ComponentsMap>;
-};
+const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {};
 
 export default Cell;
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0_1,1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Timeout] ArrowFunction
src/components/Grid/Cell.tsx:136:19
 
 const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
   const [mousedown, onMouseDown, onMouseUp] = useMouseDown();
-  const onClick = () => rest.onClick(coords);
+  const onClick = () => undefined;
 
   const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {

[Killed] BlockStatement
src/components/Grid/Cell.tsx:138:63
   const [mousedown, onMouseDown, onMouseUp] = useMouseDown();
   const onClick = () => rest.onClick(coords);
 
-  const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
-    e.preventDefault();
-    if (checkIsActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {};
 
   const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/components/Grid/Cell.tsx:140:38
 
   const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
     e.preventDefault();
-    if (checkIsActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
+    if (checkIsActiveCell(children)) {}
   };
 
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:140:9
 
   const onContextMenu = (e: React.MouseEvent<HTMLElement>) => {
     e.preventDefault();
-    if (checkIsActiveCell(children)) {
+    if (true) {
       rest.onContextMenu(coords);
     }
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] StringLiteral
src/components/Grid/Cell.tsx:148:20
   const props = {
     onClick,
     onContextMenu,
-    'data-testId': `${children}_${coords}`,
+    'data-testId': ``,
     onMouseDown,
     onMouseUp,
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0_1,1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="css-135zged"
      data-testid=""
