[Timeout] BlockStatement
src/App.tsx:5:16
 import { Top } from './components/Top/Top';
 import { Scoreboard } from './components/Scoreboard/Scoreboard';
 
-function App() {
-  return (
-    <>
-      <Top
-        feature="flag"
-        firstAction="ctrl"
-        secondAction="click"
-        name="Minesweeper"
-      />
-      <Scoreboard
-        time="000"
-        levels={['easy', 'medium', 'hard']}
-        mines="010"
-        onReset={() => null}
-      />
-    </>
-  );
-}
+function App() {}
 
 export default App;

[Survived] StringLiteral
src/App.tsx:16:36
       />
       <Scoreboard
         time="000"
-        levels={['easy', 'medium', 'hard']}
+        levels={['easy', 'medium', ""]}
         mines="010"
         onReset={() => null}
