[Survived] ArrowFunction
src/components/Grid/Grid.stories.tsx:9:36
   component: Grid,
 } as Meta;
 
-const Template: Story<GridProps> = (args) => <Grid {...args} />;
+const Template: Story<GridProps> = () => undefined;
 
 export const GridExample = Template.bind({});

[Survived] ObjectLiteral
src/components/Grid/Grid.stories.tsx:12:20
 const Template: Story<GridProps> = (args) => <Grid {...args} />;
 
 export const GridExample = Template.bind({});
-GridExample.args = {
-  children: [
-    ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
-    ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
-    ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
-    ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
-    ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
-    ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
-    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-  ],
-};
+GridExample.args = {};
 

[Survived] ArrayDeclaration
src/components/Grid/Grid.stories.tsx:13:13
 
 export const GridExample = Template.bind({});
 GridExample.args = {
-  children: [
-    ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
-    ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
-    ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
-    ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
-    ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
-    ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
-    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-  ],
+  children: [],
 };
 

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:14:21
 export const GridExample = Template.bind({});
 GridExample.args = {
   children: [
-    ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
+    ['9', '2', '9', "", '0', '0', '1', '1', '1', '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:14:46
 export const GridExample = Template.bind({});
 GridExample.args = {
   children: [
-    ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
+    ['9', '2', '9', '1', '0', '0', '1', '1', "", '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:15:51
 GridExample.args = {
   children: [
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
-    ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
+    ['1', '2', '2', '2', '1', '0', '1', '9', '1', "", '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:15:31
 GridExample.args = {
   children: [
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
-    ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
+    ['1', '2', '2', '2', '1', "", '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:16:16
   children: [
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
-    ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
+    ['0', '0', "", '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:16:6
   children: [
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
-    ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
+    ["", '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:17:16
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
-    ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
+    ['0', '0', "", '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],

[Survived] ArrayDeclaration
src/components/Grid/Grid.stories.tsx:17:5
     ['9', '2', '9', '1', '0', '0', '1', '1', '1', '1', '1', '1'],
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
-    ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
+    [],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:18:26
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
+    ['0', '1', '1', '2', "", '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:18:21
     ['1', '2', '2', '2', '1', '0', '1', '9', '1', '1', '9', '1'],
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
+    ['0', '1', '1', "", '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:19:47
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
-    ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
+    ['0', '1', '9', '3', '9', '2', '10', '0', "", '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:19:21
     ['0', '0', '1', '9', '10', '0', '2', '2', '2', '1', '1', '1'],
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
-    ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
+    ['0', '1', '9', "", '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:20:11
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
-    ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
+    ['0', "", '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:20:57
     ['0', '0', '10', '10', '1', '0', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
-    ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
+    ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', "", '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:21:61
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
-    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
+    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', ""],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:21:56
     ['0', '1', '1', '2', '2', '9', '1', '1', '1', '0', '0', '0'],
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
-    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
+    ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', "", '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:22:58
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', "", '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:22:43
     ['0', '1', '9', '3', '9', '2', '10', '0', '0', '2', '1', '1'],
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '10', '10', '0', '0', '1', "", '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:23:43
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '10', '10', '0', '0', '1', "", '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:23:48
     ['0', '2', '2', '4', '9', '2', '10', '1', '1', '1', '9', '1'],
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '10', '10', '0', '0', '1', '1', "", '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:24:61
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', ""],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
   ],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:24:36
     ['0', '1', '9', '2', '1', '1', '1', '9', '1', '2', '2', '2'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '1', '1', '0', '0', "", '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
   ],

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:25:26
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '1', '1', "", '0', '1', '1', '1', '1', '9', '1'],
   ],
 };

[Survived] StringLiteral
src/components/Grid/Grid.stories.tsx:25:36
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '10', '10', '0', '0', '1', '1', '1', '1', '9', '1'],
     ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
-    ['0', '1', '1', '1', '0', '0', '1', '1', '1', '1', '9', '1'],
+    ['0', '1', '1', '1', '0', '0', "", '1', '1', '1', '9', '1'],
   ],
 };
