[Survived] ArrowFunction
src/components/Grid/Grid.tsx:23:36
   onContextMenu: (coords: Coords) => void;
 }
 
-export const Grid: FC<GridProps> = ({ children, ...rest }) => (
-  <Wrapper size={children.length}>
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
-    )}
-  </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 

[Survived] ArrowFunction
src/components/Grid/Grid.tsx:25:19
 
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
+    {children.map(() => undefined
     )}
   </Wrapper>

[Survived] ArrowFunction
src/components/Grid/Grid.tsx:26:15
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
     {children.map((row, y) =>
-      row.map((cell, x) => (
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
+      row.map(() => undefined)
     )}
   </Wrapper>
