[Survived] ArrowFunction
src/components/Scoreboard/Level.stories.tsx:8:37
   component: Level,
 } as Meta;
 
-const Template: Story<LevelProps> = (args) => <Level {...args} />;
+const Template: Story<LevelProps> = () => undefined;
 
 export const LevelExample = Template.bind({});

[Survived] StringLiteral
src/components/Scoreboard/Level.stories.tsx:12:22
 
 export const LevelExample = Template.bind({});
 LevelExample.args = {
-  children: ['easy', 'medium', 'hard'],
+  children: ['easy', "", 'hard'],
 };
 
