[Survived] ArrowFunction
src/components/Scoreboard/Counter.stories.tsx:9:39
   component: Counter,
 } as Meta;
 
-const Template: Story<CounterProps> = (args) => <Counter {...args} />;
+const Template: Story<CounterProps> = () => undefined;
 
 export const CounterExample = Template.bind({});

[Survived] ObjectLiteral
src/components/Scoreboard/Counter.stories.tsx:12:23
 const Template: Story<CounterProps> = (args) => <Counter {...args} />;
 
 export const CounterExample = Template.bind({});
-CounterExample.args = {
-  children: '10',
-};
+CounterExample.args = {};
 
