[Survived] ArrowFunction
src/components/Scoreboard/Level.tsx:25:38
   padding: 0 0.2vw 0.2vw;
 `;
 
-export const Level: FC<LevelProps> = ({ children }) => (
-  <Select>
-    {children.map((item: string) => (
-      <Option key={item}>{item}</Option>
-    ))}
-  </Select>
-);
+export const Level: FC<LevelProps> = () => undefined;
 

[Survived] ArrowFunction
src/components/Scoreboard/Level.tsx:27:19
 
 export const Level: FC<LevelProps> = ({ children }) => (
   <Select>
-    {children.map((item: string) => (
-      <Option key={item}>{item}</Option>
-    ))}
+    {children.map(() => undefined)}
   </Select>
 );
