[Survived] ArrowFunction
src/components/Scoreboard/Reset.stories.tsx:10:37
   component: Reset,
 } as Meta;
 
-const Template: Story<ResetProps> = (args) => <Reset {...args} />;
+const Template: Story<ResetProps> = () => undefined;
 
 export const ResetExample = Template.bind({});
