[Survived] ArrowFunction
src/components/Scoreboard/Scoreboard.stories.tsx:14:42
   component: Scoreboard,
 } as Meta;
 
-const Template: Story<ScoreboardProps> = (args) => <Scoreboard {...args} />;
+const Template: Story<ScoreboardProps> = () => undefined;
 
 export const ScoreboardExample = Template.bind({});

[Survived] ArrayDeclaration
src/components/Scoreboard/Scoreboard.stories.tsx:19:11
 export const ScoreboardExample = Template.bind({});
 ScoreboardExample.args = {
   time: '000',
-  levels: ['beginner', 'intermediate', 'expert'],
+  levels: [],
   mines: '010',
 };

[Survived] StringLiteral
src/components/Scoreboard/Scoreboard.stories.tsx:19:24
 export const ScoreboardExample = Template.bind({});
 ScoreboardExample.args = {
   time: '000',
-  levels: ['beginner', 'intermediate', 'expert'],
+  levels: ['beginner', "", 'expert'],
   mines: '010',
 };
