[Survived] ArrowFunction
src/components/Top/GameName.stories.tsx:9:40
   component: GameName,
 } as Meta;
 
-const Template: Story<GameNameProps> = (args) => <GameName {...args} />;
+const Template: Story<GameNameProps> = () => undefined;
 
 export const MinesweeperGameName = Template.bind({});
