[Survived] StringLiteral
src/components/Top/GameName.tsx:8:33
   name: string;
 }
 
-const GameNameHeader = styled.h1`
-  font-size: 2em;
-`;
+const GameNameHeader = styled.h1``;
 
 export const GameName: FC<GameNameProps> = ({ name }) => {

[Survived] BlockStatement
src/components/Top/GameName.tsx:12:58
   font-size: 2em;
 `;
 
-export const GameName: FC<GameNameProps> = ({ name }) => {
-  return <GameNameHeader>{name}</GameNameHeader>;
-};
+export const GameName: FC<GameNameProps> = ({ name }) => {};
 
