[Survived] ArrowFunction
src/components/Top/Legend.stories.tsx:10:38
   component: Legend,
 } as Meta;
 
-const Template: Story<LegendProps> = (args) => <Legend {...args} />;
+const Template: Story<LegendProps> = () => undefined;
 
 export const GameLegend = Template.bind({});

[Survived] StringLiteral
src/components/Top/Legend.stories.tsx:14:12
 
 export const GameLegend = Template.bind({});
 GameLegend.args = {
-  feature: 'Flag: ',
+  feature: "",
   firstAction: 'ctrl',
   secondAction: 'click',

[Survived] StringLiteral
src/components/Top/Legend.stories.tsx:15:16
 export const GameLegend = Template.bind({});
 GameLegend.args = {
   feature: 'Flag: ',
-  firstAction: 'ctrl',
+  firstAction: "",
   secondAction: 'click',
 };
