[Survived] StringLiteral
src/components/Top/Legend.tsx:20:28
   background: #e3e3e3;
 `;
 
-const Feature = styled.span`
-  font-weight: 700;
-  display: inline-block;
-  margin-right: 0.5vw;
-  &:first-letter {
-    text-transform: capitalize;
-  }
-`;
+const Feature = styled.span``;
 
 const FirstAction = styled.span`

[Survived] BlockStatement
src/components/Top/Legend.tsx:37:77
   color: #2a48ec;
 `;
 
-const Legend: FC<LegendProps> = ({ feature, firstAction, secondAction }) => {
-  return (
-    <Parent>
-      <Feature>{feature}</Feature>
-      <FlagComboParent>
-        <FirstAction>{firstAction}</FirstAction> +{' '}
-        <SecondAction>{secondAction}</SecondAction>
-      </FlagComboParent>
-    </Parent>
-  );
-};
+const Legend: FC<LegendProps> = ({ feature, firstAction, secondAction }) => {};
 
 export default Legend;
