[Survived] ArrowFunction
src/components/Top/Top.stories.tsx:9:43
   component: Top,
 } as Meta;
 
-const Template: Story<TopComponentType> = (args) => <Top {...args} />;
+const Template: Story<TopComponentType> = () => undefined;
 
 export const TopPanel = Template.bind({});
