[Survived] ArrowFunction
src/components/Top/Top.tsx:15:42
 
 export type TopComponentType = LegendProps & GameNameProps;
 
-export const Top: FC<TopComponentType> = ({ name, ...legendProps }) => (
-  <Header>
-    <GameName name={name} />
-    <Legend {...legendProps} />
-  </Header>
-);
+export const Top: FC<TopComponentType> = () => undefined;
 
