[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:5:34
 
 const { bomb } = CellState;
 
-export const getNeighborsItems = ([y, x]: Coords): Record<
-  string,
-  [number, number]
-> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighborsItems = () => undefined;
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
killedBy: Check Increment Neighbors Simple cases Field with only 1 item
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:9:8
   string,
   [number, number]
 > => ({
-  top: [y - 1, x],
+  top: [],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
killedBy: Check Increment Neighbors Simple cases Field 3x3 with two mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Array [

[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:19:33
   leftTop: [y - 1, x - 1],
 });
 
-export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && y < length && x < length;
+export const checkItemInField = () => undefined;
 
 const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] LogicalOperator
src/helpers/CellsManipulator.ts:20:3
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && y < length && x < length;
+  y >= 0 && x >= 0 || y < length && x < length;
 
 const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
killedBy: Check Increment Neighbors Simple cases Field with only 1 item
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:20:3
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && y < length && x < length;
+  y > 0 && x >= 0 && y < length && x < length;
 
 const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Array [

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:22:60
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && y < length && x < length;
 
-const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
+const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] >= +bomb;
 
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:22:26
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && y < length && x < length;
 
-const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
+const canBeIncremented = () => undefined;
 
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:24:76
 
 const canBeIncremented = ([y, x]: Coords, field: Field) => +field[y][x] < +bomb;
 
-export const incrementNeighbors = (coords: Coords, field: Field): Field => {
-  const items = getNeighborsItems(coords);
-
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-
-      if (canBeIncremented([y, x], field))
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbors = (coords: Coords, field: Field): Field => {};
 
killedBy: Check Increment Neighbors Simple cases Field with only 1 item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [["9"]]
Received: undefined

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:27:44
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {
   const items = getNeighborsItems(coords);
 
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-
-      if (canBeIncremented([y, x], field))
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
-  }
+  for (const item of Object.values(items)) {}
 
   return field;
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:28:40
   const items = getNeighborsItems(coords);
 
   for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-
-      if (canBeIncremented([y, x], field))
-        field[y][x] = (+cell + 1).toString() as Cell;
-    }
+    if (checkItemInField(item, field)) {}
   }
 
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:32:11
       const [y, x] = item;
       const cell = field[y][x];
 
-      if (canBeIncremented([y, x], field))
+      if (false)
         field[y][x] = (+cell + 1).toString() as Cell;
     }
killedBy: Check Increment Neighbors Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:32:11
       const [y, x] = item;
       const cell = field[y][x];
 
-      if (canBeIncremented([y, x], field))
+      if (true)
         field[y][x] = (+cell + 1).toString() as Cell;
     }
killedBy: Check Increment Neighbors Simple cases Field 2x2 with two mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
      "9",
      "1",
