[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:22:55
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? '😯' : '🙂'}
-    </Button>
-  );
-};
+export const Reset: FC<ResetProps> = ({ onReset }) => {};
 
killedBy: Reset button check Should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/components/Scoreboard/Reset.tsx:32:20
       onMouseUp={onMouseUp}
       onClick={onReset}
     >
-      {mouseDown ? '😯' : '🙂'}
+      {mouseDown ? "": '🙂'}
     </Button>
   );
