[Killed] ArrowFunction
src/helpers/Field.ts:16:36
 export type Field = Cell[][];
 export type Coords = [number, number];
 
-export const emptyFieldGenerator = (
-  size: number,
-  state: Cell = CellState.empty
-): Field => Array.from(Array(size), () => new Array(size).fill(state));
+export const emptyFieldGenerator = () => undefined;
 
 export const fieldGenerator = (size: number, density: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 1x1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [["0"]]
Received: undefined

[Killed] ArrowFunction
src/helpers/Field.ts:19:37
 export const emptyFieldGenerator = (
   size: number,
   state: Cell = CellState.empty
-): Field => Array.from(Array(size), () => new Array(size).fill(state));
+): Field => Array.from(Array(size), () => undefined);
 
 export const fieldGenerator = (size: number, density: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 1x1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Array [
-   Array [
-     "0",

[Killed] BlockStatement
src/helpers/Field.ts:21:73
   state: Cell = CellState.empty
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
-export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
-    throw new Error('Density must be between 0 and 1');
-
-  let unProcessedCell = size * size,
-    restCellsWithBombs = unProcessedCell * density;
-
-  const res: Field = emptyFieldGenerator(size);
-
-  for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs === 0) return res;
-
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
-        res[i][j] = CellState.bomb;
-        restCellsWithBombs--;
-      }
-
-      unProcessedCell--;
-    }
-  }
-
-  return res;
-};
+export const fieldGenerator = (size: number, density: number): Field => {};
 
killedBy: Field Generator Simple cases Wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
src/helpers/Field.ts:22:7
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
+  if (false)
     throw new Error('Density must be between 0 and 1');
 
killedBy: Field Generator Simple cases Wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
src/helpers/Field.ts:22:7
 ): Field => Array.from(Array(size), () => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, density: number): Field => {
-  if (density > 1 || density < 0)
+  if (false || density < 0)
     throw new Error('Density must be between 0 and 1');
 
killedBy: Field Generator Simple cases Wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Density must be between 0 and 1"

Received function did not throw

[Killed] ArithmeticOperator
src/helpers/Field.ts:25:25
   if (density > 1 || density < 0)
     throw new Error('Density must be between 0 and 1');
 
-  let unProcessedCell = size * size,
+  let unProcessedCell = size / size,
     restCellsWithBombs = unProcessedCell * density;
 
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] ArithmeticOperator
src/helpers/Field.ts:26:26
     throw new Error('Density must be between 0 and 1');
 
   let unProcessedCell = size * size,
-    restCellsWithBombs = unProcessedCell * density;
+    restCellsWithBombs = unProcessedCell / density;
 
   const res: Field = emptyFieldGenerator(size);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     "0",

[Killed] UpdateOperator
src/helpers/Field.ts:31:31
   const res: Field = emptyFieldGenerator(size);
 
   for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
+    for (let j = 0; j < size; j--) {
       if (restCellsWithBombs === 0) return res;
 
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",

[Killed] ConditionalExpression
src/helpers/Field.ts:32:11
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs === 0) return res;
+      if (true) return res;
 
       if (restCellsWithBombs / unProcessedCell > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     "9",

[Killed] EqualityOperator
src/helpers/Field.ts:32:11
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs === 0) return res;
+      if (restCellsWithBombs !== 0) return res;
 
       if (restCellsWithBombs / unProcessedCell > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     "9",

[Killed] BlockStatement
src/helpers/Field.ts:34:65
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs === 0) return res;
 
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
-        res[i][j] = CellState.bomb;
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unProcessedCell > Math.random()) {}
 
       unProcessedCell--;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     "9",

[Killed] EqualityOperator
src/helpers/Field.ts:34:11
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs === 0) return res;
 
-      if (restCellsWithBombs / unProcessedCell > Math.random()) {
+      if (restCellsWithBombs / unProcessedCell <= Math.random()) {
         res[i][j] = CellState.bomb;
         restCellsWithBombs--;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     "9",

[Killed] UpdateOperator
src/helpers/Field.ts:36:9
 
       if (restCellsWithBombs / unProcessedCell > Math.random()) {
         res[i][j] = CellState.bomb;
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
 
killedBy: Field Generator Simple cases Real game field size = 10x10 with 1/4 mined cells (~25 mines
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 25
Received length: 75

[Killed] UpdateOperator
src/helpers/Field.ts:39:7
         restCellsWithBombs--;
       }
 
-      unProcessedCell--;
+      unProcessedCell++;
     }
   }
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      "9",
