[Killed] BlockStatement
src/hooks/useMouseDown.ts:6:84
 export type SetMouseDownStatus = () => void;
 export type SetMouseUpStatus = () => void;
 
-export const useMouseDown = (): [boolean, SetMouseDownStatus, SetMouseUpStatus] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+export const useMouseDown = (): [boolean, SetMouseDownStatus, SetMouseUpStatus] => {};
 
killedBy: Reset button check Should render elements with default state
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:7:46
 export type SetMouseUpStatus = () => void;
 
 export const useMouseDown = (): [boolean, SetMouseDownStatus, SetMouseUpStatus] => {
-  const [mouseDown, setMouseDown] = useState(false);
+  const [mouseDown, setMouseDown] = useState(true);
 
   const onMouseDown = () => setMouseDown(true);
killedBy: Reset button check Should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="css-1bva717"
    >
